# KeynoteTable Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
KeynoteTable Class
Members See Also
---
KeynoteTable represents the collection of keynotes (KeynoteEntries) for a document.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public class KeynoteTable : KeyBasedTreeEntryTable
```

Visual Basic
---
```text
Public Class KeynoteTable _
	Inherits KeyBasedTreeEntryTable
```

Visual C++
---
```text
public ref class KeynoteTable : public KeyBasedTreeEntryTable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..KeyBasedTreeEntryTable Autodesk.Revit.DB..::..KeynoteTable
# See Also
KeynoteTable Members
Autodesk.Revit.DB Namespace